system/blockMeshDict
FoamFile
{
	version			2.0;
	format			ascii;
	root			"";
	case			"";
	instance		"";
	local			"";
	class			dictionary;
	object			blockMeshDict;
}

convertToMeters	0.000001;

vertices
(
	(0.000000 25.000000 0.000000)
	(-25.000000 25.000000 -1.000000)
	(-25.000000 -25.000000 -1.000000)
	(0.000000 -25.000000 0.000000)
	(-25.000000 -100.000000 -1.000000)
	(0.000000 -100.000000 0.000000)
	(-25.000000 -125.000000 -1.000000)
	(0.000000 -125.000000 0.000000)
	(-50.000000 50.000000 -2.000000)
	(-75.000000 12.500000 -3.000000)
	(-250.000000 -125.000000 -10.000000)
	(-250.000000 -1250.000000 -10.000000)
	(-25.000000 -1250.000000 -1.000000)
	(0.000000 -1250.000000 0.000000)
	(-50.000000 75.000000 -2.000000)
	(-75.000000 75.000000 -3.000000)
	(0.000000 25.000000 -0.000000)
	(-25.000000 25.000000 1.000000)
	(-25.000000 -25.000000 1.000000)
	(0.000000 -25.000000 -0.000000)
	(-25.000000 -100.000000 1.000000)
	(0.000000 -100.000000 -0.000000)
	(-25.000000 -125.000000 1.000000)
	(0.000000 -125.000000 -0.000000)
	(-50.000000 50.000000 2.000000)
	(-75.000000 12.500000 3.000000)
	(-250.000000 -125.000000 10.000000)
	(-250.000000 -1250.000000 10.000000)
	(-25.000000 -1250.000000 1.000000)
	(0.000000 -1250.000000 -0.000000)
	(-50.000000 75.000000 2.000000)
	(-75.000000 75.000000 3.000000)
);

blocks
(
	hex ( 0	 1	 2	 3	16	17	18	19)	( 25	 50	  1) simpleGrading (  1	  1	  1)
	hex ( 3	 2	 4	 5	19	18	20	21)	( 25	 75	  1) simpleGrading (  1	  1	  1)
	hex ( 5	 4	 6	 7	21	20	22	23)	( 25	 25	  1) simpleGrading (  1	  1	  1)
	hex ( 2	 8	 9	 4	18	24	25	20)	( 50	 75	  1) simpleGrading (  1	  1	  1)
	hex ( 7	 6	12	13	23	22	28	29)	( 25	1150	  1) simpleGrading (  1	  1	  1)
	hex ( 6	10	11	12	22	26	27	28)	(100	1150	  1) simpleGrading (  3	  1	  1)
	hex ( 8	14	15	 9	24	30	31	25)	( 25	 75	  1) simpleGrading (  1	  1	  1)
);

edges
(	arc 4 9 (-75.000000 12.490000 -3.000000)
	arc 20 25 (-75.000000 12.490000 3.000000)
	arc 8 2 (-50.000000 49.990000 -2.000000)
	arc 24 18 (-50.000000 49.990000 2.000000)

);


boundary
(
	front
	{
		type wedge;
		faces		
		(
			(19	18	17	16)
			(21	20	18	19)
			(23	22	20	21)
			(20	25	24	18)
			(29	28	22	23)
			(28	27	26	22)
			(25	31	30	24)
		);
	}

	back
	{
		type wedge;
		faces		
		(
			( 0	 1	 2	 3)
			( 3	 2	 4	 5)
			( 5	 4	 6	 7)
			( 2	 8	 9	 4)
			( 7	 6	12	13)
			( 6	10	11	12)
			( 8	14	15	 9)
		);
	}

	outlet_pressure
	{
		type patch;
		faces		
		(
			(13	12	28	29)
			(12	11	27	28)
			(11	10	26	27)
		);
	}

	wall
	{
		type wall;
		faces		
		(
			(10	 6	22	26)
			( 6	 4	20	22)
			( 4	 9	25	20)
			( 9	15	31	25)
			(14	 8	24	30)
			( 8	 2	18	24)
			( 2	 1	17	18)
		);
	}

	inlet_helium
	{
		type patch;
		faces		
		(
			(15	14	30	31)
		);
	}

	inlet_water
	{
		type patch;
		faces		
		(
			( 1	 0	16	17)
		);
	}

	axis
	{
		type empty;
		faces		
		(
			( 0	 3	19	16)
			( 3	 5	21	19)
			( 5	 7	23	21)
			( 7	13	29	23)
		);
	}
);

mergePatchPairs
(
);
