0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293;

boundaryField
{
    front
    { 
        type            wedge;
    }
	
	back
    { 
        type            wedge;
    }
    wall
    {
        type            fixedValue;
        value           $internalField;
    }
    inlet_water
    {
        type            inletOutlet;
        phi             rhoPhi;
        inletValue      $internalField;
    }
	inlet_helium
    {
        type            inletOutlet;
        phi             rhoPhi;
        inletValue      $internalField;
    }
    outlet_pressure
    {
        type            inletOutlet;
        phi             rhoPhi;
        inletValue      $internalField;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
