0/alpha.air.orig
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    front
    { 
        type            wedge;
    }
	
	back
    { 
        type            wedge;
    }
	
    wall
    {
        type            alphaContactAngle;
        thetaProperties
        (
            ( water air ) 90 0 0 0
        );
        value           uniform 1;
    }
    outlet_pressure
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
    }
	inlet_water
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
	inlet_helium
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
